examples/html/info.org
#+TITLE: Org HTML Info Demo
#+OPTION: ^:nil -:nil

#+HTML_HEAD: <link rel="stylesheet" type="text/less" href="style/less/readme.less"/>
#+HTML_HEAD: <script src="style/js/less-1.3.0.min.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/js/jquery-1.7.1.min.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/bootstrap/js/bootstrap-modal.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/bootstrap/js/bootstrap-transition.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/bootstrap/js/bootstrap-dropdown.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/bootstrap/js/bootstrap-collapse.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/js/prettify.js" type="text/javascript"></script>
#+HTML_HEAD: <script src="style/js/codeblock.js" type="text/javascript"></script>

#+INFOJS_OPT: view:info toc:t ltoc:t mouse:underline buttons:1 path:http://orgmode.org/org-info.js

* 關於此文件

** 如何快速瀏覽此文件

此文件使用 org-info.js 進行按鍵的設定，使用方式和 info manual 一樣，
你可以按下 n 瀏覽下一章節，按下 p 瀏覽前一章節。

欲知道更多按鍵的使用方式，請按下 ?

如果你是 firefox 的使用者，為了方便觀看此文件，請關閉 firefox 的 typeheadfind。
關閉方式: 在 firefox 的瀏覽欄上面輸入

: about:config

找到

: accessibilty.typeaheadfind

並將其值設定為

: false

** 如何編譯此文件

要編輯此文件，必須使用 emacs 打開，建議使用 emacs 版本 24 來進行編輯。
編輯完檔案後，使用 Ctrl-c Ctrl-e h h，就可以輸出成 HTML 檔案。

(或是按下 M-x org-html-export-to-html 也可以)
* 表格

** 一般表格

#+CAPTION: People
#+ATTR_HTML: :border 2 :rules all :frame border
| Name     | Age |
|----------+-----|
| Jhon Lee |  18 |
| Marry    |  20 |

** 試算表

#+TBLNAME: org-babel-tests
| functionality    | block        | arg |    expected |     results | pass |
|------------------+--------------+-----+-------------+-------------+------|
| basic evaluation |              |     |             |             | pass |
|------------------+--------------+-----+-------------+-------------+------|
| emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
| shell            | basic-shell  |     |           6 |           6 | pass |
| ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
| python           | basic-python |     | hello world | hello world | pass |
| R                | basic-R      |     |          13 |          13 | pass |
#+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

* 程式碼

** Python

#+BEGIN_SRC python
  # indent your Python code to put into an email
  import glob
  # glob supports Unix style pathname extensions
  python_files = glob.glob('*.py')
  for file_name in sorted(python_files):
      print '    ------' + file_name

      with open(file_name) as f:
          for line in f:
              print '    ' + line.rstrip()

      print
#+END_SRC

** C/C++

#+BEGIN_SRC c
  // C hello world example
  #include <stdio.h>

  int main()
  {
    printf("Hello world\n");
    return 0;
  }
#+END_SRC

* 其他項目

你可以自由自在的添加你想添加的資訊，輸出成 HTML info 檔案。
