examples/html/info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org HTML Info Demo</title>
<!-- 2013-08-03 Sat 04:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/less" href="style/less/readme.less"/>


</head>
<body>
<div id="content">
<h1 class="title">Org HTML Info Demo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 關於此文件</a>
<ul>
<li><a href="#sec-1-1">1.1. 如何快速瀏覽此文件</a></li>
<li><a href="#sec-1-2">1.2. 如何編譯此文件</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 表格</a>
<ul>
<li><a href="#sec-2-1">2.1. 一般表格</a></li>
<li><a href="#sec-2-2">2.2. 試算表</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 程式碼</a>
<ul>
<li><a href="#sec-3-1">3.1. Python</a></li>
<li><a href="#sec-3-2">3.2. C/C++</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 其他項目</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 關於此文件</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 如何快速瀏覽此文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
此文件使用 org-info.js 進行按鍵的設定，使用方式和 info manual 一樣，
你可以按下 n 瀏覽下一章節，按下 p 瀏覽前一章節。
</p>

<p>
欲知道更多按鍵的使用方式，請按下 ?
</p>

<p>
如果你是 firefox 的使用者，為了方便觀看此文件，請關閉 firefox 的 typeheadfind。
關閉方式: 在 firefox 的瀏覽欄上面輸入
</p>

<pre class="example">
about:config
</pre>

<p>
找到
</p>

<pre class="example">
accessibilty.typeaheadfind
</pre>

<p>
並將其值設定為
</p>

<pre class="example">
false
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 如何編譯此文件</h3>
<div class="outline-text-3" id="text-1-2">
<p>
要編輯此文件，必須使用 emacs 打開，建議使用 emacs 版本 24 來進行編輯。
編輯完檔案後，使用 Ctrl-c Ctrl-e h h，就可以輸出成 HTML 檔案。
</p>

<p>
(或是按下 M-x org-html-export-to-html 也可以)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 表格</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 一般表格</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption align="above"><span class="table-number">Table 1:</span> People</caption>

<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="right">Age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Jhon Lee</td>
<td class="right">18</td>
</tr>

<tr>
<td class="left">Marry</td>
<td class="right">20</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 試算表</h3>
<div class="outline-text-3" id="text-2-2">
<table id="org-babel-tests" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">functionality</th>
<th scope="col" class="left">block</th>
<th scope="col" class="right">arg</th>
<th scope="col" class="left">expected</th>
<th scope="col" class="left">results</th>
<th scope="col" class="left">pass</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">basic evaluation</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">pass</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">emacs lisp</td>
<td class="left">basic-elisp</td>
<td class="right">2</td>
<td class="left">4</td>
<td class="left">4</td>
<td class="left">pass</td>
</tr>

<tr>
<td class="left">shell</td>
<td class="left">basic-shell</td>
<td class="right">&#xa0;</td>
<td class="left">6</td>
<td class="left">6</td>
<td class="left">pass</td>
</tr>

<tr>
<td class="left">ruby</td>
<td class="left">basic-ruby</td>
<td class="right">&#xa0;</td>
<td class="left">org-babel</td>
<td class="left">org-babel</td>
<td class="left">pass</td>
</tr>

<tr>
<td class="left">python</td>
<td class="left">basic-python</td>
<td class="right">&#xa0;</td>
<td class="left">hello world</td>
<td class="left">hello world</td>
<td class="left">pass</td>
</tr>

<tr>
<td class="left">R</td>
<td class="left">basic-R</td>
<td class="right">&#xa0;</td>
<td class="left">13</td>
<td class="left">13</td>
<td class="left">pass</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 程式碼</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Python</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #5d9ae4; font-style: italic;"># </span><span style="color: #5d9ae4; font-style: italic;">indent your Python code to put into an email</span>
<span style="color: #FFC125;">import</span> glob
<span style="color: #5d9ae4; font-style: italic;"># </span><span style="color: #5d9ae4; font-style: italic;">glob supports Unix style pathname extensions</span>
<span style="color: #4BC98A;">python_files</span> = glob.glob(<span style="color: #95E454; font-style: italic;">'*.py'</span>)
<span style="color: #FFC125;">for</span> file_name <span style="color: #FFC125;">in</span> <span style="color: #4BC98A;">sorted</span>(python_files):
    <span style="color: #FFC125;">print</span> <span style="color: #95E454; font-style: italic;">'    ------'</span> + file_name

    <span style="color: #FFC125;">with</span> <span style="color: #4BC98A;">open</span>(file_name) <span style="color: #FFC125;">as</span> f:
        <span style="color: #FFC125;">for</span> line <span style="color: #FFC125;">in</span> f:
            <span style="color: #FFC125;">print</span> <span style="color: #95E454; font-style: italic;">'    '</span> + line.rstrip()

    <span style="color: #FFC125;">print</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> C/C++</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #5d9ae4; font-style: italic;">// </span><span style="color: #5d9ae4; font-style: italic;">C hello world example</span>
<span style="color: #4BC98A;">#include</span> <span style="color: #95E454; font-style: italic;">&lt;stdio.h&gt;</span>

<span style="color: #CAE682;">int</span> <span style="color: #AD7FA8; font-weight: bold; font-style: italic;">main</span>()
{
  printf(<span style="color: #95E454; font-style: italic;">"Hello world</span><span style="color: #4eee94;">\n</span><span style="color: #95E454; font-style: italic;">"</span>);
  <span style="color: #FFC125;">return</span> <span style="color: #E53F3F; font-weight: bold;">0</span>;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 其他項目</h2>
<div class="outline-text-2" id="text-4">
<p>
你可以自由自在的添加你想添加的資訊，輸出成 HTML info 檔案。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2013-08-03 Sat 04:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="validation"></p>
</div>
</body>
</html>
